lamer0k/CortexLib/Tools/RegistersGenerator/N32L403.svd
            </registers>
        </peripheral>

        <peripheral>
            <name>DBG</name>
            <description>debug support for MCU</description>
            <groupName>DBG</groupName>
            <baseAddress>0xE0042000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>DBG_ID</name>
                    <displayName>DBG_ID</displayName>
                    <description>DBG_ID</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xf0ffffff</resetMask>
                    <fields>
                        <field>
                            <name>REV_NUM_L</name>
                            <description>REV_NUM_L</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>REV_NUM_H</name>
                            <description>REV_NUM_H</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DEV_NUM_M</name>
                            <description>DEV_NUM_M</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DEV_NUM_H</name>
                            <description>DEV_NUM_H</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>FLASH</name>
                            <description>FLASH</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DEV_NUM_L</name>
                            <description>DEV_NUM_L</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>SRAM</name>
                            <description>SRAM</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DBG_CTRL</name>
                    <displayName>DBG_CTRL</displayName>
                    <description>DBG_CTRL</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x003fff07</resetMask>
                    <fields>
                        <field>
                            <name>SLEEP</name>
                            <description>SLEEP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STOP</name>
                            <description>STOP</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STDBY</name>
                            <description>STDBY</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IWDG_STOP</name>
                            <description>IWDG_STOP</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WWDG_STOP</name>
                            <description>WWDG_STOP</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM1_STOP</name>
                            <description>TIM1_STOP</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM2_STOP</name>
                            <description>TIM2_STOP</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM3_STOP</name>
                            <description>TIM3_STOP</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM4_STOP</name>
                            <description>TIM4_STOP</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CAN_STOP</name>
                            <description>CAN_STOP</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2C1SMBUS_TIMEOUT</name>
                            <description>I2C1SMBUS_TIMEOUT</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2C2SMBUS_TIMEOUT</name>
                            <description>I2C2SMBUS_TIMEOUT</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM8_STOP</name>
                            <description>TIM8_STOP</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM5_STOP</name>
                            <description>TIM5_STOP</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM6_STOP</name>
                            <description>TIM6_STOP</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM7_STOP</name>
                            <description>TIM7_STOP</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM9_STOP</name>
                            <description>TIM9_STOP</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
