lamer0k/CortexLib/Tools/RegistersGenerator/N32L403.svd
            </registers>
        </peripheral>

        <peripheral>
            <name>DMA</name>
            <description>Direct memory access controller</description>
            <groupName>DMA</groupName>
            <baseAddress>0x40020000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>DMA_Channel1</name>
                <description>DMA channel1 global interrupt</description>
                <value>11</value>
            </interrupt>
            <interrupt>
                <name>DMA_Channel2</name>
                <description>DMA channel2 global interrupt</description>
                <value>12</value>
            </interrupt>
            <interrupt>
                <name>DMA_Channel3</name>
                <description>DMA channel3 global interrupt</description>
                <value>13</value>
            </interrupt>
            <interrupt>
                <name>DMA_Channel4</name>
                <description>DMA channel4 global interrupt</description>
                <value>14</value>
            </interrupt>
            <interrupt>
                <name>DMA_Channel5</name>
                <description>DMA channel5 global interrupt</description>
                <value>15</value>
            </interrupt>
            <interrupt>
                <name>DMA_Channel6</name>
                <description>DMA channel6 global interrupt</description>
                <value>16</value>
            </interrupt>
            <interrupt>
                <name>DMA_Channel7</name>
                <description>DMA channel7 global interrupt</description>
                <value>17</value>
            </interrupt>
            <interrupt>
                <name>DMA_Channel8</name>
                <description>DMA channel8 global interrupt</description>
                <value>18</value>
            </interrupt>
            <registers>
                <register>
                    <name>DMA_INTSTS</name>
                    <displayName>DMA_INTSTS</displayName>
                    <description>DMA_INTSTS</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>GLBF1</name>
                            <description>GLBF1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXCF1</name>
                            <description>TXCF1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTXF1</name>
                            <description>HTXF1</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERRF1</name>
                            <description>ERRF1</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GLBF2</name>
                            <description>GLBF2</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXCF2</name>
                            <description>TXCF2</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTXF2</name>
                            <description>HTXF2</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERRF2</name>
                            <description>ERRF2</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GLBF3</name>
                            <description>GLBF3</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXCF3</name>
                            <description>TXCF3</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTXF3</name>
                            <description>HTXF3</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERRF3</name>
                            <description>ERRF3</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GLBF4</name>
                            <description>GLBF4</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXCF4</name>
                            <description>TXCF4</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTXF4</name>
                            <description>HTXF4</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERRF4</name>
                            <description>ERRF4</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GLBF5</name>
                            <description>GLBF5</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXCF5</name>
                            <description>TXCF5</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTXF5</name>
                            <description>HTXF5</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERRF5</name>
                            <description>ERRF5</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GLBF6</name>
                            <description>GLBF6</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXCF6</name>
                            <description>TXCF6</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTXF6</name>
                            <description>HTXF6</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERRF6</name>
                            <description>ERRF6</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GLBF7</name>
                            <description>GLBF7</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXCF7</name>
                            <description>TXCF7</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTXF7</name>
                            <description>HTXF7</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERRF7</name>
                            <description>ERRF7</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GLBF8</name>
                            <description>GLBF8</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXCF8</name>
                            <description>TXCF8</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTXF8</name>
                            <description>HTXF8</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERRF8</name>
                            <description>ERRF8</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_INTCLR</name>
                    <displayName>DMA_INTCLR</displayName>
                    <description>DMA_INTCLR</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CGLBF1</name>
                            <description>CGLBF1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTXCF1</name>
                            <description>CTXCF1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHTXF1</name>
                            <description>CHTXF1</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CERRF1</name>
                            <description>CERRF1</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CGLBF2</name>
                            <description>CGLBF2</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTXCF2</name>
                            <description>CTXCF2</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHTXF2</name>
                            <description>CHTXF2</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CERRF2</name>
                            <description>CERRF2</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CGLBF3</name>
                            <description>CGLBF3</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTXCF3</name>
                            <description>CTXCF3</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHTXF3</name>
                            <description>CHTXF3</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CERRF3</name>
                            <description>CERRF3</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CGLBF4</name>
                            <description>CGLBF4</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTXCF4</name>
                            <description>CTXCF4</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHTXF4</name>
                            <description>CHTXF4</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CERRF4</name>
                            <description>CERRF4</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CGLBF5</name>
                            <description>CGLBF5</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTXCF5</name>
                            <description>CTXCF5</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHTXF5</name>
                            <description>CHTXF5</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CERRF5</name>
                            <description>CERRF5</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CGLBF6</name>
                            <description>CGLBF6</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTXCF6</name>
                            <description>CTXCF6</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHTXF6</name>
                            <description>CHTXF6</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CERRF6</name>
                            <description>CERRF6</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CGLBF7</name>
                            <description>CGLBF7</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTXCF7</name>
                            <description>CTXCF7</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHTXF7</name>
                            <description>CHTXF7</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CERRF7</name>
                            <description>CERRF7</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CGLBF8</name>
                            <description>CGLBF8</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTXCF8</name>
                            <description>CTXCF8</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHTXF8</name>
                            <description>CHTXF8</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CERRF8</name>
                            <description>CERRF8</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
