lamer0k/CortexLib/Tools/RegistersGenerator/N32L403.svd
                <register>
                    <name>RCC_CTRLSTS</name>
                    <displayName>RCC_CTRLSTS</displayName>
                    <description>RCC_CTRLSTS</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0c00246c</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>LSIEN</name>
                            <description>LSIEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSIRD</name>
                            <description>LSIRD</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MSIEN</name>
                            <description>MSIEN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MSIRD</name>
                            <description>MSIRD</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MSIRANGE</name>
                            <description>MSIRANGE</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>MSITRIM</name>
                            <description>MSITRIM</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>RAMRSTF</name>
                            <description>RAMRSTF</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMRSTF</name>
                            <description>RMRSTF</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MMURSTF</name>
                            <description>MMURSTF</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PINRSTF</name>
                            <description>PINRSTF</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PORRSTF</name>
                            <description>PORRSTF</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SFTRSTF</name>
                            <description>SFTRSTF</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IWDGRSTF</name>
                            <description>IWDGRSTF</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WWDGRSTF</name>
                            <description>WWDGRSTF</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LPWRRSTF</name>
                            <description>LPWRRSTF</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCC_AHBPRST</name>
                    <displayName>RCC_AHBPRST</displayName>
                    <description>RCC_AHBPRST</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00001e00</resetMask>
                    <fields>
                        <field>
                            <name>RNGCRST</name>
                            <description>RNGCRST</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SACRST</name>
                            <description>SACRST</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADCRST</name>
                            <description>ADCRST</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCC_CFG2</name>
                    <displayName>RCC_CFG2</displayName>
                    <description>RCC_CFG2</description>
                    <addressOffset>0x2c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00007000</resetValue>
                    <resetMask>0xff03f1ff</resetMask>
                    <fields>
                        <field>
                            <name>ADCHPRES</name>
                            <description>ADCHPRES</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ADCPLLPRES</name>
                            <description>ADCPLLPRES</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>ADC1MPRES</name>
                            <description>ADC1MPRES</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>ADC1MSEL</name>
                            <description>ADC1MSEL</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RNGCPRES</name>
                            <description>RNGCPRES</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>TIMCLKSEL</name>
                            <description>TIMCLKSEL</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCC_CFG3</name>
                    <displayName>RCC_CFG3</displayName>
                    <description>RCC_CFG3</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00003840</resetValue>
                    <resetMask>0x0006fb80</resetMask>
                    <fields>
                        <field>
                            <name>UCDREN</name>
                            <description>UCDREN</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USBXTALESS</name>
                            <description>USBXTALESS</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UCDR300MSEL</name>
                            <description>UCDR300MSEL</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TRNG1MPRES</name>
                            <description>TRNG1MPRES</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>TRNG1MSEL</name>
                            <description>TRNG1MSEL</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TRNG1MEN</name>
                            <description>TRNG1MEN</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCC_RDCTRL</name>
                    <displayName>RCC_RDCTRL</displayName>
                    <description>RCC_RDCTRL</description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00003fdf</resetMask>
                    <fields>
                        <field>
                            <name>LPTIMSEL</name>
                            <description>LPTIMSEL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>LPUARTSEL</name>
                            <description>LPUARTSEL</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>LPTIMEN</name>
                            <description>LPTIMEN</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LPUARTEN</name>
                            <description>LPUARTEN</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LCDEN</name>
                            <description>LCDEN</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LPRCNTEN</name>
                            <description>LPRCNTEN</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LPTIMRST</name>
                            <description>LPTIMRST</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LPUARTRST</name>
                            <description>LPUARTRST</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LCDRST</name>
                            <description>LCDRST</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LPRCNTRST</name>
                            <description>LPRCNTRST</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCC_PLLHSIPRE</name>
                    <displayName>RCC_PLLHSIPRE</displayName>
                    <description>RCC_PLLHSIPRE</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>PLLHSIPRE</name>
                            <description>PLLHSIPRE</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLLSRCDIV</name>
                            <description>PLLSRCDIV</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCC_SRAM_CTRLSTS</name>
                    <displayName>RCC_SRAM_CTRLSTS</displayName>
                    <description>RCC_SRAM_CTRLSTS</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000003f</resetMask>
                    <fields>
                        <field>
                            <name>ERR1IEN</name>
                            <description>ERR1IEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERR1RSTEN</name>
                            <description>ERR1RSTEN</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERR1STS</name>
                            <description>ERR1STS</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERR2IEN</name>
                            <description>ERR1IEN</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERR2RSTEN</name>
                            <description>ERR1RSTEN</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERR2STS</name>
                            <description>ERR1STS</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
