lamer0k/CortexLib/Tools/RegistersGenerator/N32L403.svd
                <register>
                    <name>RTC_BKP1</name>
                    <displayName>RTC_BKP1</displayName>
                    <description>RTC_BKP1</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>	
                <register>
                    <name>RTC_BKP2</name>
                    <displayName>RTC_BKP2</displayName>
                    <description>RTC_BKP2</description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>		
                <register>
                    <name>RTC_BKP3</name>
                    <displayName>RTC_BKP3</displayName>
                    <description>RTC_BKP3</description>
                    <addressOffset>0x58</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>		
	            <register>
                    <name>RTC_BKP4</name>
                    <displayName>RTC_BKP4</displayName>
                    <description>RTC_BKP4</description>
                    <addressOffset>0x5c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>			
	            <register>
                    <name>RTC_BKP5</name>
                    <displayName>RTC_BKP5</displayName>
                    <description>RTC_BKP5</description>
                    <addressOffset>0x60</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>	
                <register>
                    <name>RTC_BKP6</name>
                    <displayName>RTC_BKP6</displayName>
                    <description>RTC_BKP6</description>
                    <addressOffset>0x64</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>		
                <register>
                    <name>RTC_BKP7</name>
                    <displayName>RTC_BKP7</displayName>
                    <description>RTC_BKP7</description>
                    <addressOffset>0x68</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>	
                <register>
                    <name>RTC_BKP8</name>
                    <displayName>RTC_BKP8</displayName>
                    <description>RTC_BKP8</description>
                    <addressOffset>0x6c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>	
	            <register>
                    <name>RTC_BKP9</name>
                    <displayName>RTC_BKP9</displayName>
                    <description>RTC_BKP9</description>
                    <addressOffset>0x70</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>	
                <register>
                    <name>RTC_BKP10</name>
                    <displayName>RTC_BKP10</displayName>
                    <description>RTC_BKP10</description>
                    <addressOffset>0x74</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>		
	            <register>
                    <name>RTC_BKP11</name>
                    <displayName>RTC_BKP11</displayName>
                    <description>RTC_BKP11</description>
                    <addressOffset>0x78</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>		
                <register>
                    <name>RTC_BKP12</name>
                    <displayName>RTC_BKP12</displayName>
                    <description>RTC_BKP12</description>
                    <addressOffset>0x7c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>		
                <register>
                    <name>RTC_BKP13</name>
                    <displayName>RTC_BKP13</displayName>
                    <description>RTC_BKP13</description>
                    <addressOffset>0x80</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>		
                <register>
                    <name>RTC_BKP14</name>
                    <displayName>RTC_BKP14</displayName>
                    <description>RTC_BKP14</description>
                    <addressOffset>0x84</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>		
                <register>
                    <name>RTC_BKP15</name>
                    <displayName>RTC_BKP15</displayName>
                    <description>RTC_BKP15</description>
                    <addressOffset>0x88</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>			
                <register>
                    <name>RTC_BKP16</name>
                    <displayName>RTC_BKP16</displayName>
                    <description>RTC_BKP16</description>
                    <addressOffset>0x8c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>	
                <register>
                    <name>RTC_BKP17</name>
                    <displayName>RTC_BKP17</displayName>
                    <description>RTC_BKP17</description>
                    <addressOffset>0x90</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>	
                <register>
                    <name>RTC_BKP18</name>
                    <displayName>RTC_BKP18</displayName>
                    <description>RTC_BKP18</description>
                    <addressOffset>0x94</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>	
                <register>
                    <name>RTC_BKP19</name>
                    <displayName>RTC_BKP19</displayName>
                    <description>RTC_BKP19</description>
                    <addressOffset>0x98</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>	
                <register>
                    <name>RTC_BKP20</name>
                    <displayName>RTC_BKP20</displayName>
                    <description>RTC_BKP20</description>
                    <addressOffset>0x9c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>					
                <register>
                    <name>RTC_TSCWKUPCTRL</name>
                    <displayName>RTC_TSCWKUPCTRL</displayName>
                    <description>RTC_TSCWKUPCTRL</description>
                    <addressOffset>0xa0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000008</resetValue>
                    <resetMask>0x0000000d</resetMask>
                    <fields>
                        <field>
                            <name>WKUPEN</name>
                            <description>WKUPEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WKUPCNF</name>
                            <description>WKUPCNF</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WKUPOFF</name>
                            <description>WKUPOFF</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_TSCWKUPCNT</name>
                    <displayName>RTC_TSCWKUPCNT</displayName>
                    <description>RTC_TSCWKUPCNT</description>
                    <addressOffset>0xa4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x000002fe</resetValue>
                    <resetMask>0x00003fff</resetMask>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>CNT</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>14</bitWidth>
                        </field>
                    </fields>
                </register>
